app/views/posts/index.html.erb

<%= '<br/>'.html_safe if user_signed_in? %>
<%= link_to 'New Post', (params[:type].present? ? params[:type].downcase+'s' : "post") + "/new", class: "btn btn-success" if user_signed_in? %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."type" IN ('Lego')