app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("about", "created_at", "image", "name", "order_link", "type", "updated_at", "video", "weight") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "image" = $1, "updated_at" = $2 WHERE "posts"."type" IN ('Lego') AND "posts"."id" = 2  [["image", "http://www.whitegadget.com/attachments/pc-wallpapers/80480d1317269591-lego-star-wars-lego-star-wars-pic-gallery.jpg"], ["updated_at", Mon, 09 Jun 2014 00:21:39 UTC +00:00]]

  def destroy
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."type" IN ('Lego') AND "posts"."id" = $1  [["id", 2]]

    def set_post
      @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."type" IN ('Lego') AND "posts"."id" = $1 LIMIT 1  [["id", "2"]]